/* GIT - Распределнная система управления версиями */

/* 
1. Позволяет сохранять различные версии проектов 
2. Быстрых переход между разными версиями проектов
3. Откат к предыдущим версиям при необходимости
4. Улучшает процесс командной работы над одним проектом
5. Независимая одновременная разработка различных новых функций
*/

/* 
Разница между GIT и GITHUB: 
GIT - распределенная система контроля версий
Github - сервис хостинга GIT репозиториев
*/

/* На каждом компьютере находится полная версия репозитория. Это позволяет работать с репозиторием локально без интернета */

/* Чтобы установить локально на компьютере логин для git 
git config --global user.name <..> */
