// new git repository
/* Инициализация папки - git init */
/* master - название ветки

можно всегда менять название ветки - git branch -m <name> */

/* 
Области GIT:
1. Рабочая директория (working directory) - содержит файлы и папки вышего проекта. Файлы добавляются в эту область путем создания файлов и папок автоматически.
2. Индекс (staging area) - нахоядтся папки и файлы которые подготовлены для комита (сохранения в репозиторий) (проверка: git status). Файлы и папки можно добавить к сохранению в репозиторий (поместить в область индекс) путем команды git add (с помощью git add file.txt - можно добавить конкретный файл в индекс, а с помощью git add . - все изменения)
3. Репозиторий (repository) - все что находится в скрытых папках git. После git add можно сохранить файл в репозиторий путем git commit (создастся новый обьект git)
 */
