/* чтобы удалить .git папку:  rm -rf .git */
/* c помощью git checkout можно перейти к определенной версии проекта */

/*
Статусы отслеживания файлов:
1. untracked - неотслеживаемый
2. unmodified - немодифицированный
3. modified - модифицированный
4. Staged - подготовленный
 */

/* git init > git add . > git commit -m "massage" - после этих команд создается обьект гит с текущей версией и уникальным SHA1 хэшем  через который можно вернуться к этой версии потом (команда git log - посмотреть хэш. Команда git checkout <хэш> - откатить версию до заданного коммита (указывать часть хэша), вернуться обратно - git checkout <branch>) */
