/* 
Типы обьектов GIT: 
1.Blob (файл) - для каждого файла создается отдельный блоб
2.Tree (папка) - содержит ссылки на файлы или подпапки
3.Commit (коммит) - создается тогда когда мы сохраням текущую версию проекта
4.Anotated tag (аннотированный тег) - можно создать в любой момент и перемещаться по версиям проекта с помощью тега
 */

/* Каждый обьект GIT имеет уникальный ID (SHA1 хэш) */

/* Входные данные переменной длинны => SHA1 хэш-функция => 2341242454353BBC234CAS123 (фиксированная длинна 160 бит) (40 символов) */

/* Все обьекты связываются между собой с помощью хэша */
