/* Коммит - это указатель на дерево (папку) */

/* Какие данные находятся в коммите:
1. Имя и email автора
2. Описание коммита
3. Родительские коммиты - SHA1
4. Дерево - SHA1 */

/* Каждый новый коммит ссылается на предыдущий коммит */

/* HEAD - указатель который ссылается на определенный коммит (ссылка на SHA1 определенного коммита). Двигая этот указатель с одного коммита на другой можно перемещаться по истории и менять версии проекта в рабочей директории */

/* когда мы создаем коммит - мы создаем обьект в гите который указывает на дерево определнной версии проекта */
