/* Сервисы хостинга GIT репозиториев:
1. GitHUB
2. BitBucket
3. GitLab
 */

/* git clone <url> - клонирование удаленного репозитория в локальный */

/* 
ORIGIN - имя удаленного репозитория по-умолчанию

git pull - скачивание обновления с удаленной ветки в локальную
git push - загрузить на гитхаб свой код

git branch -a - отображает все ветки , включая те, которые находятся на удаленных репозиториях
*/

/* 
Связь сущетсвующего локального репозитория с удаленным 

git remote add origin <url> - подключение удаленного репозитория
git push -u origin <branch> - связь изменений из локальной ветки в удаленную с созданием связи между ними
git push - загрузка изменений после установки связи 
*/

/* Чтобы иметь право загружать изменения на удаленный репозиторий (после попытки первого пуша) нужно ввести данные github (например токен). Его можно получить в настройках => developer settings => token */
